catalog/includes/paypal_wpp/xml/doDirectPayment.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <RequesterCredentials xmlns="urn:ebay:api:PayPalAPI">
      <Credentials xmlns="urn:ebay:apis:eBLBaseComponents">
        <Username>PAYPAL_USERNAME</Username>
        <Password>PAYPAL_PASSWORD</Password>
        <Subject></Subject>
      </Credentials>
    </RequesterCredentials>
  </soap:Header>
  <soap:Body>
    <DoDirectPaymentReq xmlns="urn:ebay:api:PayPalAPI">
      <DoDirectPaymentRequest>
        <Version xmlns="urn:ebay:apis:eBLBaseComponents">PAYPAL_VERSION</Version>
        <DoDirectPaymentRequestDetails xmlns="urn:ebay:apis:eBLBaseComponents">
          <PaymentAction>PAYPAL_PAYMENT_ACTION</PaymentAction>
          <PaymentDetails>
            <OrderTotal currencyID="PAYPAL_CURRENCY">PAYPAL_ORDER_TOTAL</OrderTotal>
            <OrderDescription>PAYPAL_ORDER_DESCRIPTION</OrderDescription>
            <ItemTotal currencyID="PAYPAL_CURRENCY">PAYPAL_ITEM_TOTAL</ItemTotal>
            <ShippingTotal currencyID="PAYPAL_CURRENCY">PAYPAL_SHIPPING_TOTAL</ShippingTotal>
            <HandlingTotal currencyID="PAYPAL_CURRENCY">PAYPAL_HANDLING_TOTAL</HandlingTotal>
            <TaxTotal currencyID="PAYPAL_CURRENCY">PAYPAL_TAX_TOTAL</TaxTotal>
            <Custom>PAYPAL_CUSTOM</Custom>
            <InvoiceID>PAYPAL_INVOICE_ID</InvoiceID>
            <NotifyURL>PAYPAL_NOTIFY_URL</NotifyURL>
            <ButtonSource>PAYPAL_BUTTON_SOURCE</ButtonSource>
            <ShipToAddress>
              <Name>PAYPAL_SHIPPING_NAME</Name>
              <Street1>PAYPAL_SHIPPING_ADDRESS1</Street1>
              <Street2>PAYPAL_SHIPPING_ADDRESS2</Street2>
              <CityName>PAYPAL_SHIPPING_CITY</CityName> 
              <StateOrProvince>PAYPAL_SHIPPING_STATE</StateOrProvince>
              <PostalCode>PAYPAL_SHIPPING_ZIP</PostalCode>
              <Country>PAYPAL_SHIPPING_COUNTRY</Country>
            </ShipToAddress>
            PAYMENT_DETAILS_ITEM
          </PaymentDetails>
          <CreditCard>
            <CardOwner>
              <Payer>PAYPAL_BUYER_EMAIL</Payer>
              <PayerName>
              <FirstName>PAYPAL_FIRST_NAME</FirstName>
              <LastName>PAYPAL_LAST_NAME</LastName>
              </PayerName>
              <Address>
                <Street1>PAYPAL_ADDRESS1</Street1>
                <Street2>PAYPAL_ADDRESS2</Street2>
                <CityName>PAYPAL_CITY</CityName> 
                <StateOrProvince>PAYPAL_STATE</StateOrProvince>
                <PostalCode>PAYPAL_ZIP</PostalCode>
                <Country>PAYPAL_COUNTRY</Country>
              </Address>
            </CardOwner>
            <CreditCardType>PAYPAL_CC_TYPE</CreditCardType>
            <CreditCardNumber>PAYPAL_CC_NUMBER</CreditCardNumber>
            PAYPAL_CC_UK_DATA
            <ExpMonth>PAYPAL_CC_EXP_MONTH</ExpMonth>
            <ExpYear>PAYPAL_CC_EXP_YEAR</ExpYear>
            <CVV2>PAYPAL_CC_CVV2</CVV2>
            CARDINAL_CENTINEL_3DS
          </CreditCard>
          <IPAddress>PAYPAL_IP_ADDRESS</IPAddress>
          <MerchantSessionId>PAYPAL_MERCHANT_SESSION_ID</MerchantSessionId>
        </DoDirectPaymentRequestDetails>
      </DoDirectPaymentRequest>
    </DoDirectPaymentReq>
  </soap:Body>
</soap:Envelope>